[
  {
    "title": "Terminate negativity",
    "image": "https://miro.medium.com/v2/resize:fit:720/format:webp/1*Xd6SFoNx96714wr7Jao2HA.jpeg",
    "content": "On Monday, I asked you to pay attention this week to the news sources and social media accounts that made you angry or negative (Arnold’s Monday Mindset). I told you to write them down. Now, it’s time to do something about it. This weekend, I want you to find ways to remove those sources of negativity from your life. Unfollow them, make a commitment not to watch them, whatever it takes. And we will do something more extreme for the next two days. I know you might think, “But Arnold, that’s how I get the news. I have to stay informed every hour about what’s happening in the world.” Let me tell you how I deal with social media and the news. First, the news. I read two newspapers every morning and try to tune into local TV news in the evening (especially my friend Elex Michaelson, who is always informative and not outrageous). Guess how often the newspaper makes me enraged? It’s rare. Do I miss updates every hour? Does that hurt me in some way? No. I’m not Governor anymore. I can still act on news that makes me angry by getting it the old-fashioned way. When I read that hospitals didn’t have enough protective equipment for doctors and nurses in 2020, I read it in a newspaper and had plenty of time to donate a million dollars to help. When I saw that homeless veterans were stuck in tents, it was on local news. I had plenty of time to donate tiny homes. I’d go insane and probably spend all of my money if I scrolled the news every minute like all of you do. Now, let’s talk about social media. I don’t read my newsfeed. I read my mentions from all of you, and I close it. I get my news the boomer way, and that works. I don’t need to know what’s trending. If it’s important, it will be in the newspaper tomorrow or local news tonight. I would never give up social media because it’s a direct connection to my fans, and I always want to make sure to thank a few of you every day because I know that I wouldn’t exist without you. But the newsfeed? Garbage. And the negative or angry people who yell at me on social media? I scroll right past them. I hate to disappoint you, but I’ve been ignoring naysayers for 65 years. When I was 10 and said I belonged in America, they said I was crazy. When I was 15 and said I’d be the greatest bodybuilder of all time, they got me checked out by a doctor. When I was 30 and said I’d be a leading man, they said my body was too big, my accent was too scary, and I’d have to change my name. When I was 56 and said I’d be Governor, they said I didn’t have the experience. When I was 72, and the last Terminator movie didn’t do as well as we hoped, they said it might be time for me to retire and hang out with my animals. Now I’m turning 76 next month, and people keep asking me what it feels like to have two shows dominating the TV charts. I’m not telling you this to brag because I didn’t do any of it alone. I’m telling you so that you know a big secret to my success is tuning out negativity. If you need evidence that what I’m challenging you to do this weekend works, I’m right here. So first, unfollow, and remove the sources of negativity you noted this week. And then, spend the weekend like me. Don’t look at your newsfeed. Read the real news. Pick up your paper. Watch the local news if you need more. If you look at social media and someone has argued with or insulted you, don’t react. Keep going on with your life. Ignore the naysayers. It’s worked for me. I know it will work for you. Let’s terminate the negativity. Once again, thanks for being a part of the village. We hope you all have a wonderful weekend."
  }
]
