[
  {
    "title": "Terminate negativity",
    "image": "https://miro.medium.com/v2/resize:fit:720/format:webp/1*Xd6SFoNx96714wr7Jao2HA.jpeg",
    "tags": ["inspiration", "positive"],
    "content": "On Monday, I asked you to pay attention this week to the news sources and social media accounts that made you angry or negative (Arnold’s Monday Mindset). I told you to write them down. Now, it’s time to do something about it. This weekend, I want you to find ways to remove those sources of negativity from your life. Unfollow them, make a commitment not to watch them, whatever it takes. And we will do something more extreme for the next two days. I know you might think, “But Arnold, that’s how I get the news. I have to stay informed every hour about what’s happening in the world.” Let me tell you how I deal with social media and the news. First, the news. I read two newspapers every morning and try to tune into local TV news in the evening (especially my friend Elex Michaelson, who is always informative and not outrageous). Guess how often the newspaper makes me enraged? It’s rare. Do I miss updates every hour? Does that hurt me in some way? No. I’m not Governor anymore. I can still act on news that makes me angry by getting it the old-fashioned way. When I read that hospitals didn’t have enough protective equipment for doctors and nurses in 2020, I read it in a newspaper and had plenty of time to donate a million dollars to help. When I saw that homeless veterans were stuck in tents, it was on local news. I had plenty of time to donate tiny homes. I’d go insane and probably spend all of my money if I scrolled the news every minute like all of you do. Now, let’s talk about social media. I don’t read my newsfeed. I read my mentions from all of you, and I close it. I get my news the boomer way, and that works. I don’t need to know what’s trending. If it’s important, it will be in the newspaper tomorrow or local news tonight. I would never give up social media because it’s a direct connection to my fans, and I always want to make sure to thank a few of you every day because I know that I wouldn’t exist without you. But the newsfeed? Garbage. And the negative or angry people who yell at me on social media? I scroll right past them. I hate to disappoint you, but I’ve been ignoring naysayers for 65 years. When I was 10 and said I belonged in America, they said I was crazy. When I was 15 and said I’d be the greatest bodybuilder of all time, they got me checked out by a doctor. When I was 30 and said I’d be a leading man, they said my body was too big, my accent was too scary, and I’d have to change my name. When I was 56 and said I’d be Governor, they said I didn’t have the experience. When I was 72, and the last Terminator movie didn’t do as well as we hoped, they said it might be time for me to retire and hang out with my animals. Now I’m turning 76 next month, and people keep asking me what it feels like to have two shows dominating the TV charts. I’m not telling you this to brag because I didn’t do any of it alone. I’m telling you so that you know a big secret to my success is tuning out negativity. If you need evidence that what I’m challenging you to do this weekend works, I’m right here. So first, unfollow, and remove the sources of negativity you noted this week. And then, spend the weekend like me. Don’t look at your newsfeed. Read the real news. Pick up your paper. Watch the local news if you need more. If you look at social media and someone has argued with or insulted you, don’t react. Keep going on with your life. Ignore the naysayers. It’s worked for me. I know it will work for you. Let’s terminate the negativity. Once again, thanks for being a part of the village. We hope you all have a wonderful weekend."
  },
  {
    "title": "How to Identify “Truthy” Tech Trends",
    "image": "https://miro.medium.com/v2/resize:fit:720/0*YUcZNknBUHNGZ8Sd",
    "tags": ["inspiration", "truth"],
    "isPublished": true,
    "content": "Do you remember Amazon’s Connected Homes? Only a few years ago, the tech giant touted it as the latest in “smart home” technology — where, for example, you could easily bring your cup to the kitchen, and ask Alexa to fill it. In a video promo, that feature looked pretty cool. When I was invited to preview Amazon’s “Home of the Future” in person, however, I quickly realized you couldn’t just hold your cup to the faucet. You also had to say, “Alexa, tell [brand name of the sink] to fill the cup with 8 ounces of water”. Telling your branded faucet exactly how much water you’d like is not something you’d actually want to do when you’re groggy and thirsty at 2am. But there’s a whole set of technologies like these — devices or platforms promised as innovative, which break down when inserted into our everyday lives. While watching yet another promo for Connected Homes that depicted a San Francisican in a minimalist apartment talking to his AI as the “future” I said to a friend, “Seems pretty truthy. Originally coined by Stephen Colbert to satirize deceptive beliefs in politics, the tech world is rife with truthiness — attempts to market us a new product or evangelize emerging technology that’s exciting at first glance, but quickly loses its luster when real world considerations creep in. (In Amazon’s case, that includes the FTC hitting the company with fines for Alexa violating user privacy.) Spotting the latest outbreak of truthiness in technology has become at least as important to sniffing it out in the political arena. While there are always exceptions, truthy tech usually comes wrapped in these aspects:"
  },
  {
    "title": "I miss the internet.",
    "image": "https://miro.medium.com/v2/resize:fit:720/format:webp/1*jyZQjnQAlcoeNCQ8oBkujA.jpeg",
    "tags": ["internet", "technology", "social media"],
    "isPublished": true,
    "content": "I know this is going to make me sound old – but I miss the internet. The real internet. The one we used to have. Before it all got so much less – and somehow so much more – complicated. I went online for the first time around 2001. The 90s had ended, and the world was coming online while I was coming out of my shell and becoming more self-aware. I discovered myself – the version of myself that could exist beyond the boundaries of my family, my church life, and my strictly heteronormative world – in endless threads on Absolutepunk.net. It was a place where I could talk about music, my passions, who I was, and who I wanted to be. I miss that internet. The one that existed before terms of service. The one that existed before social graphs. The one where being a User meant having a degree of respect, not being treated like a retention/churn statistic. The internet I pine for wasn’t perfect – far from it. But its imperfections felt like the quirks of a beloved friend. The slow, warbling dial-up connection tones, the thrill of joining a new forum, the anticipation as you waited for a page to load, and the luxury of anonymity were all part of the charm. Back then, the internet felt like a vast frontier, a boundless expanse waiting to be discovered. You didn’t so much surf the web as explore it, encountering unknown territories and unexpected gems. Websites were less about utility and more about passion. Amateur webmasters crafted their domains as personal expressions, little slices of their world that they invited you into. Social media had not yet standardized our online experiences, and content wasn’t algorithmically manicured. The internet felt, somehow, more human, more real. A hodgepodge of self-expression, creativity, and human connection, punctuated by amusingly tacky GeoCities animations and early memes. Crucially, the internet was a place of self-discovery. It was where you could stumble upon different worldviews, confront your prejudices, engage with others who were different from you – and in doing so, learn more about yourself. For many of us, it was the first space where we could voice our thoughts without fear of judgment, a safe haven where we could explore our identities. It feels as if we’ve reached an impasse with the internet of today, a disillusioned juncture from which there’s no turning back. The once vast, chaotic, and thrilling digital landscape is now meticulously partitioned, monitored, and optimized, every inch claimed by corporations intent on predicting our behaviors and preferences. The sense of exploration, serendipity, and genuine human connection is a nostalgic memory, a distant echo from a bygone era. The homogeneity of the modern web is disheartening. Every website and platform is just a slight variation on a handful of templates. The eccentricity, the vibrant individuality, and the raw expression that once pulsated across the net all seem to have been replaced by either an inoffensive, user-friendly sameness or an algorithm-endorsed near-genocidal mania of hate speech that is somehow deemed socially acceptable. Worse still, today’s internet is a place of scrutiny, surveillance, and unprecedented data exploitation. We’ve traded our privacy and autonomy for the convenience and connectivity it provides, and in so doing, have become commodities in an unseen market. In the pursuit of progress and personalization, we have inadvertently sterilized the very essence of the web, transforming it from a shared experience into a solitary echo chamber. The internet has always been a reflection of society, but it used to amplify our diversity and creativity. Now, it reflects only our passivity and conformity. It’s become a mirror to our worst tendencies – to exploit, polarize, and retreat into our comfort zones. The pioneering spirit of the early internet users, community builders, and webmasters has been lost in the transition to an internet dominated by a handful of tech behemoths. Today’s internet feels less like a global community and more like a series of walled gardens, each meticulously maintained to keep out any unpredicted, and thus, unprofitable, elements. Twitter and Reddit, with their sprawling communities and user-generated content, did once feel like the last vestiges of the internet I cherished. They were spaces where individuals from diverse backgrounds could gather, debate, share, and create. But even these platforms, once seen as guardians of the free and open internet, have succumbed to forces shaping the modern web. Twitter’s decline was swift and steep. Under Musk’s reign, what was once a public square for lively discourse started resembling a top-down media corporation. The platform began prioritizing monetization over meaningful conversation, controlling narratives rather than fostering organic discussion. The emphasis on free speech and dialogue was replaced by an algorithmic drive towards echo chambers and controversial content that boosted engagement but undermined thoughtful interaction. Reddit’s transformation was equally painful to witness. The self-proclaimed “front page of the internet” was once a haven for vibrant, niche communities united by shared interests and a commitment to open discussion. But in recent years, it has betrayed this principle. Increasing monetization, invasive advertising, and heavy enforcement of controversial content policies have eroded the sense of community that once defined the platform. Reddit’s commitment to user privacy – a vital pillar of my early internet – has been questionable. The platform’s data collection and sharing practices have undermined user trust, further distancing it from the haven it used to be. For those who grew up idolizing Aaron Swartz – this feels like a slap in the face. It is disheartening to see these platforms – once symbols of the internet’s potential for democratized content creation and community building – transform in this way. Their decline serves as a painful reminder of the relentless corporatization of the internet, leaving us yearning for the digital wilderness that once was. It feels as if we’re witnessing the last vestiges of the open, user-centric web being snuffed out, with little more than a resigned sigh echoing in the corporate-dominated void that remains. I know it’s not all doom and gloom; platforms like Mastodon, Bluesky, and Warpcast exist, and we can still build things we love. But I can’t shake the feeling that we’re all too tired now to make a difference. To view these platforms with anything but a weary sense of resignation. It’s the relentless cycle of hype and disappointment, the constant fight for privacy and agency, or the Sisyphean task of carving out spaces of authenticity in an increasingly commodified web. Maybe we’ve just grown weary of the relentless pace, the performative pressure, the ceaseless barrage of content that the modern internet demands. We’re worn out, and who can blame us? The endless scroll, the relentless push notifications, and the constant pressure to consume, share, and engage are exhausting. We’ve been conditioned to equate our worth with our online presence, to quantify our lives in likes and retweets, and to shrug off hours and hours of traumatic content that just leaves us feeling numb. And that brings me to the heart of it. I miss the internet. But to a degree, I also miss the person I was back when I had it; the person who had more energy and more fucks to give, who wasn’t quite so jaded by it all. I miss the wide-eyed curiosity, the unbridled excitement, and the audacious hope we brought to our early digital voyages. The internet was a fresh frontier; we were pioneers, ready to stake our claim in the vast digital expanse. We weren’t just interacting with the technology; we were shaping it, molding it in our image. We were innovators, creators, and dreamers. We didn’t just use the internet; we lived it. And we stopped being those people. Or at least I did. It wasn’t abrupt. It was a gradual, creeping realization. The signs were minor at first. A slight annoyance at an unsolicited ad, a waning interest in a trending hashtag, a growing fatigue from scrolling through perfectly curated social media feeds. But, before I knew it, I had stopped experiencing joy online. I used to log on with a sense of anticipation. What new song would I discover? What enlightening article would I stumble upon? What fascinating discussions would I be part of? But as the internet evolved, these moments of joy became increasingly sparse. They were replaced with a sense of obligation, an expectation to constantly engage, stay up-to-date, and project a flawless digital persona. I was no longer exploring the internet; I merely existed on it. My time online was dominated by consumption – reading, watching, scrolling – but the thrill of discovery was gone. I was constantly absorbing content, but it felt hollow, unsatisfying. This vast digital realm that once felt like a playground had morphed into a workspace, an arena where I was always on, always available, always performing. The pressure to engage, network, and optimize every post for maximum reach and impact sucked the joy out of the experience. The relentless cycle of consumption and creation, coupled with the growing intrusion of privacy and the manipulation of personal data, added to my disillusionment. The fun, vibrant chaos of the early internet was replaced by a sleek, homogenized, and overly commercialized version. In essence, my relationship with the internet had fundamentally changed. It was no longer a joyful escape, a space for self-discovery and connection. Instead, it had become a source of stress, a battleground of competing agendas that demanded more than it gave. And so, I changed. I became less patient, less curious, more cynical. The person who once delighted in the boundless possibilities of the internet had been replaced by someone wearied by its limitations, disillusioned by its transformation, and disheartened by its lost potential. And I lost a part of myself. The internet is still a powerful tool, an essential communication, learning, and activism conduit. It’s a platform that can amplify marginalized voices and catalyze social change. We’ve seen this with movements like Black Lives Matter and the push for trans rights, where the internet has been instrumental in raising awareness, building solidarity, and driving action. These movements have leveraged the internet’s global reach to share stories, expose injustices, and mobilize support on a scale that would have been unthinkable in the pre-digital age. The internet has allowed them to bypass traditional gatekeepers, connect with allies across the globe, and shape public discourse in a profound and enduring way. But the platforms enabling this activism have also shown a disconcerting indifference to these struggles. After all, these platforms’ priority is to keep users engaged – to keep us clicking, scrolling, and reacting. This drive for engagement has often led to the commodification of activism, reducing profoundly personal and political struggles to hashtags and trend cycles. Whether engagement comes from positive affirmation or from conflict doesn’t really matter to these platforms as long as it keeps users on the site interacting with the content. This can – and does – only lead to a perverse situation where these platforms benefit from activism and its backlash. Controversy, after all, drives clicks as much as consensus. This reality often leads to a distorted representation of social movements. Nuanced debates are flattened into sound bites, complex issues are reduced to binary positions, and the voices of extremists are often amplified at the expense of those seeking constructive dialogue. I have to believe we can still shape some kind of future for the internet. I have to believe that it’s not too late. We need to engage critically with the technology we use. To interrogate the business models, challenge the data practices, and resist the urge to reduce our interactions to transactions. Because it’s not just reshaping the internet – it’s also reshaping ourselves. The internet has always been a mirror, reflecting our interests, our concerns, our hopes, and our fears. As we strive to build a more inclusive, respectful, and diverse digital realm, we’re also revealing what kind of people we aspire to be. It demands patience, persistence, and a willingness to challenge powerful incumbents. It requires us to not only reimagine the internet but also to reimagine ourselves as more than passive consumers of digital content. But it’s a challenge worth taking on. Because what’s at stake is not just the future of the internet, but the future of how we learn, communicate and connect; our right to shape the technology that, in turn, shapes us. In the process, we may find that we’ve become the very people we’ve been longing for – individuals who are not just observers of change but drivers of it. Individuals who don’t just use the internet but influence it. Individuals who are not just shaped by the web but who shape it in return. And in that process of shaping and being shaped, we might rediscover the joy, the excitement, the sense of possibility that first drew us glowing screens, late at night, while the rest of the world slept."
  }
]
